# DeleteWorksetSettings Class

---
This class represents the settings used to delete a workset.
SystemObject Autodesk.Revit.DBDeleteWorksetSettings
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class DeleteWorksetSettings : IDisposable

    Public Class DeleteWorksetSettings
    	Implements IDisposable

    public ref class DeleteWorksetSettings : IDisposable

    type DeleteWorksetSettings =
        class
            interface IDisposable
        end
The DeleteWorksetSettings type exposes the following members.
| Name| Description
---|---|---
| DeleteWorksetSettings|  Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option.
| DeleteWorksetSettings(DeleteWorksetOption, WorksetId)|  Constructs a DeleteWorksetSettings object.
Top
| Name| Description
---|---|---
| DeleteWorksetOption|  The current delete workset option.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| WorksetId|  The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the DeleteWorksetSettings
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace